OdRxOverrule.hasOverrule(OdRxObject!System.Runtime.CompilerServices.IsConst*,OdRxClass*)
\details
Checks whether the specified overrule handles a given object and returns True if the object
is to be handled by overrule, or False, otherwise.
\param pOverruleClass [in]  A raw pointer to the class description object to which the overrule applies.
\param pSubject [in]  A raw pointer to an object to be overruled.

OdRxOverrule.isOverruling
\details
Checks whether the overruling mechanism is enabled (true) or disabled (false).

OdRxOverrule.setIsOverruling(System.Boolean)
\details
Enables or disables the overruling mechanism.
\param bIsOverruling [in]  Determines whether the overruling mechanism is enabled (true) or disabled (false).

OdRxOverrule.removeOverrule(OdRxClass*,OdRxOverrule*)
\details
Unregisters an object for the given class.
This method returns eOk if successful.
\param pClass [in]  A raw pointer to the class description object to which the overrule applies.
\param pOverrule [in]  A raw pointer to an object to be overruled.

OdRxOverrule.addOverrule(OdRxClass*,OdRxOverrule*,System.Boolean)
\details
Registers an object for a given class to be overruled.
This method returns eOk if successful.
\param pClass [in]  A raw pointer to the class description object to which the overrule applies.
\param pOverrule [in]  A raw pointer to an object to be overruled.
\param bAddAtLast [in]  Determines whether the pair should be added in the end of the overrule collection.

OdRxOverrule.isApplicable(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Determines whether the overrule is applicable and returns True if the overrule can be applied,
or False, otherwise. It is a pure virtual method that must be implemented in the derived class.
\param pOverruledSubject [in]  A raw pointer to an object to be overruled.

OdRxOverrule.Dispose
\details
Destructor deletes an instance of this class.